{
    "types": [
        {
            "name": "Keystone",
            "id": "keystone",
            "sponsors": [
                {
                    "name": "Merck",
                    "id": "merck",
                    "headline": "Merck",
                    "description": "",
                    "logo": "/static/media/sponsors/merck.svg"
                }
            ]
        },
        {
            "name": "Diamond",
            "id": "diamond",
            "sponsors": [
                {
                    "name": "Pydantic Logfire",
                    "id": "pydantic_logfire",
                    "headline": "Pydantic Logfire",
                    "description": "From the team behind Pydantic, Logfire is a new type of observability platform built on the same belief as our open source library — that the most powerful tools can be easy to use.",
                    "logo": "/static/media/sponsors/pydantic_logfire.png"
                }
            ]
        },
        {
            "name": "Platinum",
            "id": "platinum",
            "sponsors": [
                {
                    "name": "QuantCo",
                    "id": "quantco",
                    "headline": "",
                    "description": "At QuantCo, we leverage expertise in data science, engineering, and economics to help organizations turn data into decisions. Founded by 4 PhDs from Harvard and Stanford, we are now more than 180 professionals with extensive quantitative, AI, engineering, and business experience.\\nOur solutions include algorithmic pricing, data-driven claims management, high-dimensional forecasting solutions, classification engines, and cancer diagnostics.\\nWe are globally distributed with offices in Berlin, Boston, Cologne, Karlsruhe, London, Munich, San Francisco, and Zurich.",
                    "logo": "/static/media/sponsors/quantco.svg"
                },
                {
                    "name": "E.On",
                    "id": "eon",
                    "headline": "",
                    "description": "At E.ON Digital Technology we love technology. As digital pioneers within the E.ON Group, we firmly believe in the power of transformation to create new business opportunities and drive innovation. Every day we act according to our purpose 'Making New Energy Work'. Step by step, we are digitising all parts of the energy system.",
                    "logo": "/static/media/sponsors/eon.svg"
                },
                {
                    "name": "Hopsworks",
                    "id": "hopsworks",
                    "headline": "",
                    "description": "Hopsworks is the pioneering AI Lakehouse platform designed to support MLOps, data science, data engineering, and machine learning within a unified, seamless environment. The AI Lakehouse is a modern infrastructure built around the industry’s first enterprise feature store, made to support the unique needs of AI and machine learning workloads.\n\nIt simplifies the deployment and development of AI models and provides a structured, efficient approach to building and maintaining AI systems, enabling faster model creation and smoother production deployment.",
                    "logo": "/static/media/sponsors/hopsworks.svg"
                }
            ]
        },
        {
            "name": "Gold",
            "id": "gold",
            "sponsors": [
                {
                    "name": "Rosen",
                    "id": "rosen",
                    "headline": "We are empowered by technology",
                    "description": "For us, technology is the driving force of progress to ensure a more sustainable future for our customers, their assets and society.\\n\\nAs a global technology company, we focus on empowering our customers to make the best decisions for their critical industrial assets. With a portfolio of highly advanced proprietary diagnostic technologies, a vast and unique data set, and industry-leading software solutions combined with integrity engineering consulting services, we offer a unique synergy that allows us to transform data into knowledge. Knowledge enables smarter decision-making and delivers a comprehensive understanding of asset safety, lifetime, and performance.",
                    "logo": "/static/media/sponsors/rosen_c.svg"
                }
            ]
        },
        {
            "name": "Silver",
            "id": "silver",
            "sponsors": [
                {
                    "name": "Energy & Meteo",
                    "id": "energy_meteo",
                    "headline": "Energy & Meteo",
                    "description": "",
                    "logo": "/static/media/sponsors/em.svg"
                }
            ]
        },
        {
            "name": "Diversity Sponsors",
            "id": "diversity-sponsors",
            "sponsors": []
        },
        {
            "name": "Institutional Partners",
            "id": "institutional-sponsors",
            "sponsors": [
                {
                    "name": "Python Softwareverband e.V.",
                    "id": "pysv",
                    "headline": "Python Softwareverband e.V.",
                    "description": "The Python Software Softwareverband or PySV is an association that supports and promotes the Python community in German-speaking countries.",
                    "logo": "/static/media/sponsors/pysv.svg"
                },
                {
                    "name": "NumFOCUS",
                    "id": "numfocus",
                    "headline": "NumFOCUS",
                    "description": "The mission of NumFOCUS is to promote open practices in research, data, and scientific computing by serving as a fiscal sponsor for open source projects and organizing community-driven educational programs. NumFOCUS is a 501(c)(3) public charity in the United States.",
                    "logo": "/static/media/sponsors/numfocus.svg"
                },
                {
                    "name": "Pioneers Hub",
                    "id": "pioneershub",
                    "headline": "Pioneers Hub",
                    "description": "Supporting local tech communities and connecting them globally.",
                    "logo": "/static/media/sponsors/pioneershub.svg"
                }
            ]
        },
        {
            "name": "Community Partners",
            "id": "community-partners",
            "sponsors": []
        }
    ]
}
