{
  "types": [
    {
      "name": "Diamond",
      "id": "diamond",
      "sponsors": [
        {
          "name": "Kleinanzeigen and mobile.de",
          "id": "adevinta",
          "description": "Kleinanzeigen and mobile.de are shaping the future of sustainable e-commerce as well as disrupting the status quo of buying and selling vehicles. We are building powerful online platforms using the latest technologies and methods. Our websites and apps help people to find whatever they're looking for in their local communities – whether it's a car or motorcycle, a job, an apartment, a sofa, a concert ticket, financial services, or even new friends. Every connection made or item found makes a difference by creating a world where people share more and waste less.",
          "logo": "/static/media/sponsors/ebayk-mobile.png"
        }
      ]
    },
    {
      "name": "Platinum",
      "id": "platinum",
      "sponsors": [
        {
          "name": "QuantCo",
          "id": "quantco",
          "padding": 30,
          "description": "QuantCo leverages data science, engineering, and economics expertise to help organizations turn data into decisions. QuantCo was founded by four Harvard and Stanford PhDs. Headquartered in Boston, QuantCo has offices in Berlin, Cologne, Karlsruhe, London, Munich, San Francisco, and Zurich. Our team of over one hundred economists, data scientists, software engineers, and machine learning experts creates tangible economic impact by pairing state-of-the-art data expertise with business acumen. Our product line includes algorithmic pricing, data-driven claims management, and high-dimensional forecasting solutions. Our customers include some of the largest financial, retail, industrial, and healthcare organizations in Europe and the US. We impact core business processes and decisions by combining data insights with scalable engineering solutions.",
          "logo": "/static/media/sponsors/quantco.png"
        },
        {
          "name": "alcemy GmbH",
          "id": "alcemy",
          "padding": 30,
          "description": "The Berlin-based start-up alcemy was founded in 2018 to bring the concrete and cement industry into a more sustainable age. alcemy uses machine learning and control technology to predict the quality properties of cement and concrete. We provide relevant insights along the entire value chain in real time - from cement grinding to the processing of concrete on the construction site. This enables the production of sustainable and significantly CO2-reduced cements and concretes.",
          "logo": "/static/media/sponsors/alcemy.jpg"
        },
        {
          "name": "Rosenxt Group",
          "id": "rosenxt",
          "description": "Rosenxt is a forward-thinking technology group — we are visionary architects of progress with 45 years of engineering excellence.\n \n\nAs a privately owned global partner with around 400 employees, we look far beyond tomorrow, are committed to the long-term and thus turning opportunities into successful\n ventures. We are tech enthusiasts through and through, diving deep into the latest technologies. This expertise in various technology fields, such as sensors, autonomous robotic, AI or advanced materials and our strong R&D mindset allows us to develop highly\n innovative products and services for customer in most challenging environments such as subsea, industrial, renewables, or the integrity of water and energy supply.\n\nOur work environment is dynamic, team oriented and combines the flexibility and spirit of an advanced start-up organization with the security of a company that has been family-run for many decades. Are you ready to become part of our success story and shape\n the future together with us?",
          "logo": "/static/media/sponsors/rosenxt_tourqoise.png"
        },
        {
          "name": "Gurobi Optimization",
          "id": "gruobi",
          "description": "With Gurobi’s decision intelligence technology, customers can make optimal business decisions in seconds. From workforce scheduling and portfolio optimization to supply chain design and everything in between, Gurobi identifies the optimal solution, out of trillions of possibilities based on real-world variables and constraints. Over 2,500 global customers across 40+ industries run on Gurobi, including SAP and Air France, as well as over 80% of the world’s leading enterprises. For more information, please visit https://www.gurobi.com/ or call +49 69 677765837.",
          "logo": "/static/media/sponsors/gurobi.jpg"
        },
        {
          "name": "Hopsworks",
          "id": "hopsworks",
          "description": "Hopsworks Enterprise Feature Store is the leading enterprise Machine Learning platform for the full lifecycle of AI projects. It offers best in-class performances and an effective collaborative layer for all data teams, allowing them to leverage any data source for any application, at any performance or scale and across any environment.",
          "logo": "/static/media/sponsors/hopsworks.svg"
        },
        {
          "name": "The Mobility House",
          "id": "mobilityhouse",
          "description": "The goal of The Mobility House is to create a zero-emission energy and mobility future. Our technology unites the automotive and energy industries. We integrate vehicle batteries into the power grid using intelligent charging\nand energy solutions. This way, we promote the development of renewable energies, stabilize the power grid, and make electric mobility more affordable.\n\nWe support our private and business customers on their way to electromobility through the planning and building process as well as the operation of an individual charging infrastructure. As a neutral supplier, we work together with many partners such as charging infrastructure manufacturers, installation companies, back-end system operators, energy suppliers and automobile manufacturers. Our intelligent Charging and Energy Management system ChargePilot® and the underlying EV  Aggregation Platform enable our customers and partners to integrate electric  vehicles into the energy system in a way that is both beneficial and future-proof.",
          "logo": "/static/media/sponsors/mobilityhouse.png"
        },
        {
          "name": "ZEISS",
          "id": "zeiss",
          "description": "ZEISS is technology. ZEISS is optics and innovation. Our over 38,000 colleagues develop, manufacture and sell highly innovative products and solutions for our customers in a variety of business fields, generating revenue of over €8,5 billion. As one of the world's top technology companies, ZEISS has with a portfolio aligned with future growth areas like digitalization, healthcare and Smart Production, and a strong brand to boot, ZEISS is shaping the future far beyond the optics and optoelectronics industries.",
          "logo": "/static/media/sponsors/zeiss.png"
        },
        {
          "name": "Haystack (by deepset)",
          "id": "deepset",
          "description": "Haystack is an open-source LLM framework by deepset, designed for building production ready, scalable NLP applications that make use of the latest models and NLP technology. deepset offers enterprise developer tools to build NLP-driven applications using LLMs. The company has worked with customers across Europe and the U.S. on many innovative projects. The team is backed by GV, Balderton Capital and other prominent VC firms and angel investors.",
          "logo": "/static/media/sponsors/deepset.png"
        },
        {
          "name": "Intel",
          "id": "intel",
          "padding": 30,
          "description": "Intel (Nasdaq: INTC) is an industry leader, creating world-changing technology that enables global progress and enriches lives. Inspired by Moore’s Law, we continuously work to advance the design and manufacturing of semiconductors to help address our customers’ greatest challenges. By embedding intelligence in the cloud, network, edge and every kind of computing device, we unleash the potential of data to transform business and society for the better. To learn more about Intel’s innovations, go to newsroom.intel.com and intel.com.",
          "logo": "/static/media/sponsors/intel.jpg"
        }
      ]
    },
    {
      "name": "Gold",
      "id": "gold",
      "sponsors": [
        {
          "name": "Streamlit",
          "id": "snowflake",
          "description": "Streamlit is an open source Python framework to build highly interactive, dynamic data apps –– in only a few lines of code. Today, the open source community has over 250k monthly active developers, and is used by 80% of companies in the Fortune 50. With intuitive syntax, you don’t need experience in backend, CSS, HTML, or Javascript. Styling defaults have “baked-in” polish, ready to deploy anywhere, and share with anyone. Streamlit seamlessly integrates with existing workflows, your favorite Python libraries, and the latest Gen AI technology, including over 300 custom components for maximum flexibility.\n\nStreamlit is your go-to UI for anything AI, from chatbots to visualizing ML models. Data teams use it to reduce ad-hoc requests and speed up workflows with internal tools and reusable components. Whether streamlining company workflows or sharing a passion project, the possibilities are endless!\n\nVisit streamlit.io to learn more.",
          "logo": "/static/media/sponsors/streamlit-logo-primary-colormark-darktext.svg"
        },
        {
          "name": "Rosen",
          "id": "rosen",
          "description": "ROSEN is a leading company that was established in 1981. Over the last 4 decades, ROSEN has grown rapidly and is today a worldwide technology group that operates in more than 120 countries with over 3800 employees.",
          "logo": "/static/media/sponsors/rosen.png"
        },
        {
          "name": "DB Systel GmbH",
          "id": "db-systel",
          "padding": 30,
          "description": "DB Systel GmbH, headquartered in Frankfurt am Main, is a wholly owned subsidiary of DB AG and the driver of digitalisation for all Group companies. With its holistic offering, the company drives the digitalisation of business processes and rail-specific digital solutions, creating excellent customer experiences with strong customer benefits. With its effective and efficient solutions, DB Systel is paving the way for the digital future of rail. Currently more than 7,000 Systel employees are employed at the main locations in Frankfurt, Berlin and Erfurt and further subsidiary locations. They work in modern, effective organisational forms to provide the best possible support for the business units in the DB Group and their variable requirements using flexible ways of working and agile methods.",
          "logo": "/static/media/sponsors/DB.svg"
        },
        {
          "name": "Coiled",
          "id": "coiled",
          "padding": 20,
          "description": "Dask and Coiled make it easy to scale Python to run in parallel. Dask provides parallel algorithms for PyData and Coiled provides distributed infrastructure in the cloud.",
          "logo": "/static/media/sponsors/coiled.svg"
        },
        {
          "name": "Blue Yonder",
          "id": "blueyonder",
          "description": "Blue Yonder is the world leader in digital supply chain transformations and omni-channel commerce fulfillment. Our end-to-end, cognitive business platform enables retailers, manufacturers and logistics providers to best fulfill customer demand from planning through delivery. With Blue Yonder, you’ll unify your data, supply chain and retail commerce operations to unlock new business opportunities and drive automation, control and orchestration to enable more profitable, sustainable business decisions.",
          "logo": "/static/media/sponsors/Blue_Yonder.png"
        },
        {
          "name": "energy & meteo systems GmbH",
          "id": "energyms",
          "description": "The partner companies energy & meteo systems, emsys VPP and emsys grid services offer pioneering services and IT products for the market and grid integration of renewable energies worldwide. Their joint portfolio ranges from precise power forecasts and comprehensive consulting services to the development of virtual power plants as control centres for decentralised energy plants and customised platform concepts for grid planning.",
          "logo": "/static/media/sponsors/emsys.png"
        },
        {
          "name": "Toolbox Datenkompetenz",
          "id": "stackfuel",
          "description": "Join us in transforming data literacy! With the Toolbox Datenkompetenz project, we empower both aspiring and seasoned data professionals. Picture a platform seamlessly integrating learning content with state-of-the-art tools, offering hands-on experience with authentic data. Together, we shape the future of data and AI education, offering curated courses, diverse datasets, and personalized Jupyter Lab workspaces in the cloud. As project partners, the Infai and StackFuel foster an inclusive environment where every data enthusiast can hone their skills.",
          "logo": "/static/media/sponsors/TBDK_Logo_RGB_Square_OnWhite.png"
        },
        {
          "name": "Kraken",
          "id": "octopus",
          "description": "Kraken is an all-in-one, smart operating system automating much of the energy supply chain to allow outstanding service and efficiency as the world transitions to a decentralized, decarbonized energy system.",
          "logo": "/static/media/sponsors/Digital_KrakenLogo_PartOfOctopusEnergy_LightBackground_DIGITAL ONLY.png"
        },
        {
          "name": "Alexander Thamm GmbH",
          "id": "alexanderthamm",
          "description": "Alexander Thamm GmbH is the leading data & AI consultancy in the German-speaking region. As data and machine learning pioneer in Germany, we have already implemented more than 1.000 data science and AI projects in various industries. 90% of our pilots are transferred to the operational business. Our customers include BMW, VW, Daimler, Vodafone, Vorwerk, RWE, RTL and many more.",
          "logo": "/static/media/sponsors/alexander_thamm.png"
        }
      ]
    },
    {
      "name": "Silver",
      "id": "silver",
      "sponsors": [
        {
          "name": "inovex",
          "id": "inovex",
          "padding": 30,
          "description": "inovex is an IT project center driven by innovation and quality, focusing its services on Digital Transformation. About 500 IT experts provide comprehensive support to companies in making their core business digitised and agile and in the implementation of new digital use cases. The solutions we offer include Application Development, Data Management and Analytics and the development of scalable IT infrastructures, within which the digital solutions are operated in DevOps mode. We modernise existing solutions, strengthen systems against external attacks and share our knowledge through Training and Coaching.",
          "logo": "/static/media/sponsors/inovex.png"
        },
        {
          "name": "riscLOG Solution GmbH",
          "id": "risclog",
          "padding": 30,
          "description": "For over 20 years our products are among the best. With our main product ClaimX, we are market leaders in online damage management for transportation and cargo damages. But we have even much more to offer. The integrated fleet management combined with our app for reporting vehicle damages and the integrated driver's license check complete the damage management. Another product is our online certificate portal, which makes it easy to cover transportation and goods insurance.",
          "logo": "/static/media/sponsors/risclog.png"
        },
        {
          "name": "dmTECH GmbH",
          "id": "dmtech",
          "padding": 35,
          "description": "Over 1,200 IT experts at dmTECH shape the digital experience for dm customers and colleagues. Together we create IT solutions for our online shop, the “Mein dm” app, as well as for IT in dm stores, logistical distribution centers, and the corporate headquarters. dmTECH was founded in 1988 as a fully owned IT subsidiary of dm-drogerie markt and is headquartered at the dialogicum in Karlsruhe. Since October 2023, we also have a location in Wroclaw, Poland.",
          "logo": "/static/media/sponsors/dmTECH_Logo_violett_channel.svg"
        },
        {
          "name": "Protix",
          "id": "protix",
          "padding": 0,
          "description": "Protix is the leading company in insect-based ingredients for healthy and sustainable pet food, aqua culture, livestock feed and organic fertiliser. The company is on a mission to create low-footprint ingredients that solve major issues in the current food system. Protix contributes to a circular food chain by using waste from the food industry as feed for insects. In turn, the insects are processed into valuable nutrients such as proteins and lipids. Protix’s customers use these proteins and lipids as high-quality ingredients for animal feed and pet food. Moreover, residual streams from the insects are used as organic fertiliser. This way, insects close the loop and bring the food system back in balance with nature. Since its foundation in 2009, Protix has developed state-of-the-art, scalable technology, enabling the efficient use of resources and supply chain optimisation, including the reduction and recycling of residues and waste. Protix has been producing insect ingredients at its fully ramped-up industrial scale plant in The Netherlands since 2019. The company takes a measured approach to growth, resulting in profitable and cost-effective operations. Emphasising the power of partnerships, Protix actively collaborates with forward-thinking entities to unlock the full potential of insect ingredients worldwide. www.protix.eu",
          "logo": "/static/media/sponsors/Logo_PROTIX_logo_RGB__800px.png"
        },
        {
          "name": "E.On Energidistribution",
          "id": "eonde",
          "padding": 10,
          "description": "",
          "logo": "/static/media/sponsors/eon.png"
        },
        {
          "name": "Grover",
          "id": "grover",
          "padding": 20,
          "description": "",
          "logo": "/static/media/sponsors/grover.png"
        },
        {
          "name": "Sunnic Lighthouse GmbH",
          "padding": 10,
          "id": "sunnic",
          "description": "Sunnic Lighthouse GmbH, based in Hamburg, is a subsidiary of ENERPARC AG. As a leading specialist in the industry, Sunnic offers individual services in the field of renewable energies: from direct marketing and power supply to hedging transactions via power purchase agreements. The main focus is on green power from German photovoltaic plants - in addition to all other sustainable power sources.At Sunnic, Python is used to automate a large part of the processes, including trading processes. Different departments continuously analyze meteorological, trading and sales-related data from various sources and thus help to improve processes and strategies. The company relies on open source technologies, with which a standardized infrastructure has been established. The infastructure is directly connected to various power exchanges and enables automated trading.",
          "logo": "/static/media/sponsors/Sunnic-Logo-Web-RGB-01.jpg"
        },
        {
          "name": "GetYourGuide",
          "padding": 35,
          "id": "gyg",
          "description": "GetYourGuide is the leading global online marketplace for unforgettable travel experiences. Travelers use GetYourGuide to discover and book the best and most unique activities in any destination — including guided tours by local experts, culinary excursions, cooking and craft classes, skip-the-line tickets, as well as exclusive bucket-list experiences. Since its launch in 2009, travelers from over 150 countries have booked more than 80 millions tours, activities and attraction tickets through GetYourGuide. Powered by a global team of more than 700 travel and tech experts, the company is headquartered in Berlin, Germany, and has 17 local offices around the world.",
          "logo": "/static/media/sponsors/GYG.jpg"
        },
        {
          "name": "Tegtmeier Inkubator GmbH",
          "padding": 25,
          "id": "tegtmeier",
          "description": "",
          "logo": "/static/media/sponsors/tegmeier.jpg"
        },
        {
          "name": "TotalEnergies",
          "padding": 0,
          "id": "totalenergies",
          "description": null,
          "logo": null
        }
      ]
    },
    {
      "name": "Diversity Sponsors",
      "id": "diversity",
      "description": "",
      "sponsors": [
        {
          "name": "Python Software Foundation",
          "id": "psf",
          "description": "The mission of the Python Software Foundation is to promote, protect, and advance the Python programming language, and to support and facilitate the growth of a diverse and international community of Python programmers. The majority of the PSF's work is focused on empowering and supporting people within the Python community. The PSF has active grant programs that support sprints, conferences, meet ups, user groups, and Python development efforts all over the world.",
          "logo": "/static/media/sponsors/psf.png"
        },
        {
          "name": "EuroPython Society (EPS)",
          "id": "eps",
          "description": "The EuroPython Society (EPS) is a Swedish non-profit organization which organizes EuroPython conferences, supports the Python community in Europe.",
          "logo": "/static/media/sponsors/eps.png"
        },
        {
          "name": "Django Software Foundation",
          "id": "dsf",
          "description": "Development of Django is supported by an independent foundation established as a 501(c)(3) non-profit. Like most open-source foundations, the goal of the Django Software Foundation is to promote, support, and advance its open-source project: in our case, the Django Web framework.",
          "logo": "/static/media/sponsors/django.png"
        }
      ]
    },
    {
      "name": "Community Partners",
      "description": "",
      "id": "community-partner",
      "sponsors": [
        {
          "name": "PyData Berlin",
          "id": "pydata-berlin",
          "padding": 20,
          "description": "Your friendly PyData community in Berlin. Join us: https://www.meetup.com/pydata-berlin",
          "logo": "/static/media/sponsors/pydata_berlin.png"
        },
        {
          "name": "PyData Südwest",
          "id": "pydata-suedwest",
          "description": "Your friendly PyData community in Heidelberg, Mannheim and Karlsruhe. Join us: https://www.meetup.com/PyData-Suedwest",
          "logo": "/static/media/sponsors/pydata_suedwest.png"
        },
        {
          "name": "PyLadies",
          "id": "pyladies",
          "description": "PyLadies is an international mentorship group with a focus on helping more women become active participants and leaders in the Python open-source community. Their mission is to promote, educate and advance a diverse Python community through outreach, education, conferences, events and social gatherings.PyLadies also aims to provide a friendly support network for women and a bridge to the larger Python world. Anyone with an interest in Python is encouraged to participate!.",
          "logo": "/static/media/sponsors/pyladies.png"
        },
        {
          "name": "PyLadies Berlin",
          "id": "pyladies-berlin",
          "description": "PyLadies Berlin is the Berlin chapter of PyLadies, an international mentorship group with a focus on helping more women become active participants and leaders in the Python open-source community. Their mission is to promote, educate and advance a diverse Python community through outreach, education, conferences, events and social gatherings.PyLadies also aims to provide a friendly support network for women and a bridge to the larger Python world. Anyone with an interest in Python is encouraged to participate!.",
          "logo": "/static/media/sponsors/pyladies_berlin.png"
        },
        {
          "name": "PyLadies Munich",
          "padding": 20,
          "id": "pyladies-munich",
          "description": "PyLadies Hamburg is the Munich chapter of PyLadies, an international mentorship group with a focus on helping more women become active participants and leaders in the Python open-source community. Their mission is to promote, educate and advance a diverse Python community through outreach, education, conferences, events and social gatherings.PyLadies also aims to provide a friendly support network for women and a bridge to the larger Python world. Anyone with an interest in Python is encouraged to participate!.",
          "logo": "/static/media/sponsors/pyladies_munich.png"
        },
        {
          "name": "PyLadies Hamburg",
          "padding": 20,
          "id": "pyladies-hamburg",
          "description": "PyLadies Hamburg is the Hamburg chapter of PyLadies, an international mentorship group with a focus on helping more women become active participants and leaders in the Python open-source community. Their mission is to promote, educate and advance a diverse Python community through outreach, education, conferences, events and social gatherings.PyLadies also aims to provide a friendly support network for women and a bridge to the larger Python world. Anyone with an interest in Python is encouraged to participate!.",
          "logo": "/static/media/sponsors/pyladies_hamburg.png"
        },
        {
          "name": "PyLadies Südwest",
          "padding": 20,
          "id": "pyladies-suedwest",
          "description": "PyLadies Südwest is the Karsruhe chapter of PyLadies, an international mentorship group with a focus on helping more women become active participants and leaders in the Python open-source community. Their mission is to promote, educate and advance a diverse Python community through outreach, education, conferences, events and social gatherings.PyLadies also aims to provide a friendly support network for women and a bridge to the larger Python world. Anyone with an interest in Python is encouraged to participate!.",
          "logo": "/static/media/sponsors/pyladies_suedwest.jpg"
        },
        {
          "name": "CodeCrafters",
          "padding": 20,
          "id": "code_crafters",
          "description": "On CodeCrafters, you can create popular devtools from scratch. Build your own Redis, Docker, SQLite — in Rust, Go, JavaScript, etc.",
          "logo": "/static/media/sponsors/code_crafters.jpg",
          "url": "https://codecrafters.io/event/wwc23attendee/"
        }
      ]
    },
    {
      "name": "Institutional Sponsors",
      "description": "",
      "id": "institutional",
      "sponsors": [
        {
          "name": "Python Softwareverband e.V.",
          "id": "pysv",
          "description": "The Python Software Softwareverband or PySV is an association that supports and promotes the Python community in German-speaking countries.",
          "logo": "/static/media/sponsors/pysv.svg"
        },
        {
          "name": "NumFOCUS",
          "id": "numfocus",
          "description": "The mission of NumFOCUS is to promote open practices in research, data, and scientific computing by serving as a fiscal sponsor for open source projects and organizing community-driven educational programs.\nNumFOCUS is a 501(c)(3) public charity in the United States.",
          "logo": "/static/media/sponsors/numfocus.png"
        },
        {
          "name": "Pioneers Hub",
          "id": "pioneershub",
          "description": "Supporting local tech communities and connecting them globally.",
          "logo": "/static/media/sponsors/Pioneers Hub Logo vereinfacht_1.svg"
        }
      ]
    }
  ]
}
