{
    "types": [
        {
            "name": "Keystone",
            "id": "keystone",
            "sponsors": [
                {
                    "name": "Merck",
                    "id": "merck",
                    "headline": "Merck",
                    "description": "",
                    "logo": "/static/media/sponsors/merck.svg"
                }
            ]
        },
        {
            "name": "Diamond",
            "id": "diamond",
            "sponsors": [
                {
                    "name": "Pydantic Logfire",
                    "id": "pydantic_logfire",
                    "headline": "Pydantic Logfire",
                    "description": "From the team behind Pydantic, Logfire is a new type of observability platform built on the same belief as our open source library — that the most powerful tools can be easy to use.",
                    "logo": "/static/media/sponsors/pydantic_logfire.png"
                }
            ]
        },
        {
            "name": "Platinum",
            "id": "platinum",
            "sponsors": [
                {
                    "name": "QuantCo",
                    "id": "quantco",
                    "headline": "",
                    "description": "At QuantCo, we leverage expertise in data science, engineering, and economics to help organizations turn data into decisions. Founded by 4 PhDs from Harvard and Stanford, we are now more than 180 professionals with extensive quantitative, AI, engineering, and business experience.\\nOur solutions include algorithmic pricing, data-driven claims management, high-dimensional forecasting solutions, classification engines, and cancer diagnostics.\\nWe are globally distributed with offices in Berlin, Boston, Cologne, Karlsruhe, London, Munich, San Francisco, and Zurich.",
                    "logo": "/static/media/sponsors/quantco.svg"
                },
                {
                    "name": "E.On",
                    "id": "eon",
                    "headline": "",
                    "description": "At E.ON Digital Technology we love technology. As digital pioneers within the E.ON Group, we firmly believe in the power of transformation to create new business opportunities and drive innovation. Every day we act according to our purpose 'Making New Energy Work'. Step by step, we are digitising all parts of the energy system.",
                    "logo": "/static/media/sponsors/eon.svg"
                },
                {
                    "name": "Hopsworks",
                    "id": "hopsworks",
                    "headline": "",
                    "description": "Hopsworks is the pioneering AI Lakehouse platform designed to support MLOps, data science, data engineering, and machine learning within a unified, seamless environment. The AI Lakehouse is a modern infrastructure built around the industry’s first enterprise feature store, made to support the unique needs of AI and machine learning workloads.\n\nIt simplifies the deployment and development of AI models and provides a structured, efficient approach to building and maintaining AI systems, enabling faster model creation and smoother production deployment.",
                    "logo": "/static/media/sponsors/hopsworks.svg"
                },
                {
                    "name": "Zeiss",
                    "id": "zeiss",
                    "headline": "",
                    "description": "",
                    "logo": "/static/media/sponsors/zeiss.svg",
                    "scale": "scale-80"
                },
                {
                    "name": "Rosenxt",
                    "id": "rosenxt",
                    "headline": "",
                    "description": "",
                    "logo": "/static/media/sponsors/rosenxt.svg"
                },
                {
                    "name": "Gurobi Optimization",
                    "id": "gurobi",
                    "headline": "",
                    "description": "",
                    "logo": "/static/media/sponsors/gurobi.svg",
                    "website": "https://www.gurobi.com/",
                    "scale": "scale-90"
                }
            ]
        },
        {
            "name": "Gold",
            "id": "gold",
            "sponsors": [
                {
                    "name": "Rosen",
                    "id": "rosen",
                    "headline": "We are empowered by technology",
                    "description": "For us, technology is the driving force of progress to ensure a more sustainable future for our customers, their assets and society.\\n\\nAs a global technology company, we focus on empowering our customers to make the best decisions for their critical industrial assets. With a portfolio of highly advanced proprietary diagnostic technologies, a vast and unique data set, and industry-leading software solutions combined with integrity engineering consulting services, we offer a unique synergy that allows us to transform data into knowledge. Knowledge enables smarter decision-making and delivers a comprehensive understanding of asset safety, lifetime, and performance.",
                    "logo": "/static/media/sponsors/rosen_c.svg"
                },
                {
                    "name": "Sovanta",
                    "id": "sovanta",
                    "headline": "",
                    "description": "",
                    "logo": "/static/media/sponsors/sovanta.svg"
                },
                {
                    "name": "Heidelberger Druckmaschinen AG",
                    "id": "heidelberger-druckmaschinen",
                    "headline": "",
                    "description": "Training and consulting for IT, telecommunications and network technology are the focus of ExperTeach’s offering. The aim is to make the customers’ IT teams fit for the challenges of digitalization!\\n\\nExperTeach is a partner of AWS, Broadcom, Citrix, Check Point, Cisco, Microsoft and many\\n\\nother IT providers. In addition to the standard training courses offered by these companies,\\n\\nExperTeach offers a wide range of German-language IT courses developed in-house.\\n\\nMethodologically, face-to-face courses, online courses, hybrid courses as a combination of both as well as digital learning and e-learning are used.",
                    "logo": "/static/media/sponsors/heidelberger-druckmaschinen.png",
                    "website": "www.experteach.de"
                },
                {
                    "name": "ExperTeach",
                    "id": "exerteach",
                    "headline": "",
                    "description": "",
                    "logo": "/static/media/sponsors/experteach.svg",
                    "scale": "scale-80"
                }
            ]
        },
        {
            "name": "Silver",
            "id": "silver",
            "sponsors": [
                {
                    "name": "inovex GmbH",
                    "id": "inovex",
                    "headline": "inovex GmbH",
                    "logo": "/static/media/sponsors/inovex.svg",
                    "description": "inovex is an IT project center driven by innovation and quality, focusing its services on ‘Digital Transformation’. About 500 IT experts provide comprehensive support to companies in making their core business digitised and agile and in implementing new digital use cases. inovex has locations in Karlsruhe, Cologne, Munich, Hamburg, Berlin, Stuttgart, Pforzheim and Erlangen and is involved in projects throughout Germany.",
                    "website": "https://www.inovex.de/en/",
                    "scale": "scale-80"
                },
                {
                    "name": "Energy & Meteo",
                    "id": "energy_meteo",
                    "headline": "Energy & Meteo",
                    "description": "",
                    "logo": "/static/media/sponsors/em.svg"
                },
                {
                    "name": "items GmbH & Co. KG",
                    "id": "items",
                    "headline": "items GmbH & Co. KG",
                    "description": "In more than 25 years, we have become one of the leading IT service providers in the energy industry and are a complete IT service provider for the utility and mobility industries.\\n\\n As an industry specialist and innovation driver, we offer IT infrastructure, consulting, and process services with a focus on collaboration platforms, IoT integration of smart city technologies, AI products and robotics.\\n\\n We set standards in the concrete implementation of digitalisation in smart city and smart region projects. ",
                    "logo": "/static/media/sponsors/items.svg",
                    "scale": "scale-80"
                }
            ]
        },
        {
            "name": "Diversity Sponsors",
            "id": "diversity-sponsors",
            "sponsors": []
        },
        {
            "name": "Institutional Partners",
            "id": "institutional-sponsors",
            "sponsors": [
                {
                    "name": "Python Softwareverband e.V.",
                    "id": "pysv",
                    "headline": "Python Softwareverband e.V.",
                    "description": "The Python Software Softwareverband or PySV is an association that supports and promotes the Python community in German-speaking countries.",
                    "logo": "/static/media/sponsors/pysv.svg"
                },
                {
                    "name": "NumFOCUS",
                    "id": "numfocus",
                    "headline": "NumFOCUS",
                    "description": "The mission of NumFOCUS is to promote open practices in research, data, and scientific computing by serving as a fiscal sponsor for open source projects and organizing community-driven educational programs. NumFOCUS is a 501(c)(3) public charity in the United States.",
                    "logo": "/static/media/sponsors/numfocus.svg"
                },
                {
                    "name": "Pioneers Hub",
                    "id": "pioneershub",
                    "headline": "Pioneers Hub: Driving Innovation, Empowering Tech Communities",
                    "description": "Pioneers Hub is a non-profit organization dedicated to fostering innovation and supporting tech communities. By connecting professionals, enthusiasts, and experts in AI, software, and data, Pioneers Hub provides a platform for knowledge sharing, collaboration, and growth. We empower individuals and organizations to navigate cutting-edge technologies, embrace open-source excellence, and build a future shaped by creativity and innovation.",
                    "logo": "/static/media/sponsors/pioneershub.svg"
                }
            ]
        },
        {
            "name": "Community Partners",
            "id": "community-partners",
            "sponsors": [
                {
                    "name": "Hessian AI",
                    "id": "hessian_ai",
                    "headline": "hessian.AI – the Hessian Centre for Artificial Intelligence",
                    "description": "The Hessian Center for Artificial Intelligence is an association of 13 Hessian universities and pursues the goal of conducting cutting-edge research with concrete practical relevance. As a research and innovation center, hessian.AI promotes the transfer of results to business and society through the training of AI talent, the promotion of start-ups and cooperation with companies",
                    "logo": "/static/media/sponsors/hessian.AI-vertical.svg"
                },
                {
                    "name": "ULB - University and State Library Darmstadt",
                    "id": "ulb",
                    "headline": "ULB - University and State Library Darmstadt",
                    "description": "The University and State Library Darmstadt is the central university library of TU Darmstadt and the universal academic library for the population of Southern Hesse.\n\nWe provide tons of textual and other data for research and develop and maintain several software projects for open science applications, especially in the field of research data management.\n\n",
                    "logo": "/static/media/sponsors/ulb_logo_schriftzug_tuerkis_rgb.svg"
                },
                {
                    "name": "PyLadies Südwest",
                    "id": "pyladies_suedwest",
                    "headline": "PyLadies Südwest",
                    "description": "",
                    "logo": "/static/media/sponsors/pyladies-suedwest.svg",
                    "scale": "scale-80"
                },
                {
                    "name": "PyLadies Hamburg",
                    "id": "pyladies_hamburg",
                    "headline": "PyLadies Hamburg",
                    "description": "",
                    "logo": "/static/media/sponsors/pyladies-hamburg.svg",
                    "scale": "scale-90"
                },
                {
                    "name": "PyLadies Berlin",
                    "id": "pyladies_berlin",
                    "headline": "PyLadies Berlin",
                    "description": "",
                    "logo": "/static/media/sponsors/pyladies-berlin.png",
                    "scale": "scale-80"
                },
                {
                    "name": "PyLadies Munich",
                    "id": "pyladies_munich",
                    "headline": "PyLadies Munich",
                    "description": "",
                    "logo": "/static/media/sponsors/pyladies-munich.png",
                    "scale": "scale-80"
                },
                {
                    "name": "PyData Südwest",
                    "id": "pydata_suedwest",
                    "headline": "PyData Südwest",
                    "description": "PyData Südwest is a dynamic community connecting data science and AI enthusiasts across Heidelberg, Mannheim, Karlsruhe, and Heilbronn. This region, renowned for its thriving tech ecosystem and innovation hubs, plays a pivotal role in advancing AI research and applications in Germany. PyData Südwest fosters collaboration and knowledge exchange through engaging meetups and events, creating a welcoming space for professionals, researchers, and students to share ideas, explore cutting-edge technologies, and strengthen the local AI and open-source community.",
                    "logo": "/static/media/sponsors/pydata-suedwest.svg"
                },
                {
                    "name": "PyData Rhein-Main",
                    "id": "pydata_rhein_main",
                    "headline": "PyData Rhein-Main",
                    "description": "PyData Rhein-Main unites the vibrant data science and AI community across Frankfurt, Darmstadt, and Wiesbaden, regions known for their strong tech industry, academic excellence, and innovation hubs. As part of the global PyData network, it offers a platform for professionals, researchers, and enthusiasts to connect, share knowledge, and collaborate on cutting-edge topics in AI, machine learning, and open-source tools. Through regular meetups and events, PyData Rhein-Main fosters a supportive environment for learning, networking, and driving innovation in the heart of Germany.",
                    "logo": "/static/media/sponsors/pydata-rhein-main.svg"
                },
                {
                    "name": "PyData Berlin",
                    "id": "pydata_berlin",
                    "headline": "PyData Berlin",
                    "description": "PyData Berlin is a thriving hub for data science, machine learning, and AI enthusiasts in one of Europe’s leading tech capitals. As part of the global PyData network, it brings together professionals, researchers, and open-source contributors to share knowledge, foster collaboration, and explore innovative solutions. With Berlin’s dynamic startup scene, academic institutions, and vibrant international community, PyData Berlin serves as a cornerstone for advancing AI and data-driven technologies while promoting inclusivity and open-source excellence.",
                    "logo": "/static/media/sponsors/pydata-berlin.svg"
                },
                {
                    "name": "DjangoGirls",
                    "id": "djangogirls",
                    "headline": "DjangoGirls",
                    "description": "DjangoGirls is a global initiative dedicated to empowering women and non-binary individuals to break into tech by learning programming through Django, a popular Python web framework. By hosting free, beginner-friendly workshops, DjangoGirls provides a supportive and inclusive environment for participants to build their first web applications, gain confidence in coding, and connect with a welcoming community of mentors and peers. With events held in cities around the world, DjangoGirls is making tech more accessible and fostering diversity in the industry.",
                    "logo": "/static/media/sponsors/djangogirls-logo.svg"
                },
                {
                    "name": "AISR",
                    "id": "hessian_ai",
                    "headline": "AI Startup Rising (AISR) drives hessian.AI’s initiatives to support the emergence and growth of high-tech and deep-tech startups throughout Hesse",
                    "description": "AI Startup Rising (AISR) drives hessian.AI’s initiatives to support the emergence and growth of high-tech and deep-tech startups throughout Hesse. AISR seeks to build and strengthen an agile AI innovation ecosystem that is grounded in cutting-edge research and brings together talents, experts, startups, investors, and companies.",
                    "logo": "/static/media/sponsors/AISR_Logo_RGB.svg"
                },
                {
                    "name": "Probably Private",
                    "id": "probably_private",
                    "headline": "Probably Private",
                    "description": "Probably Private is a newsletter and YouTube channel for privacy and data science enthusiasts. Whether you are here to learn about AI, machine learning and data science via the lens of privacy, or the other way around, this place is an open conversation on technical and social aspects of privacy and their intersections with surveillance, law, technology, mathematics and probability.",
                    "logo": "/static/media/sponsors/probably_private_circle.png",
                    "scale": "scale-80"
                },
                {
                    "name": "spaCy",
                    "id": "spacy",
                    "headline": "spaCy",
                    "description": "Explosion is a software company specializing in developer tools for AI and Natural Language Processing. We’re the makers of spaCy, one of the leading open-source libraries for advanced NLP and Prodigy, an annotation tool for radically efficient machine teaching.",
                    "logo": "/static/media/sponsors/spacy_logo_blue.svg"
                }
            ]
        }
    ]
}
