{
  "types": [
    {
      "name": "Keystone",
      "id": "keystone",
      "sponsors": [
        {
          "name": "Merck",
          "id": "merck",
          "headline": "",
          "description": "Merck is a leading science and technology company that uniquely combines three specialized, innovation-driven businesses: Life Science, Healthcare, and Electronics. Using our multi-industry expertise, we help to address a broad range of global challenges.<br/><br/>\nFrom providing products for scientific research and biotech production to therapies against serious diseases to high-tech materials for computer chips and displays – we work to make a positive impact on millions of peoples lives every day. In 2023, 63,000 colleagues in 65 countries generated sales of 21 billion euros. Headquartered in Darmstadt, Germany, we are publicly listed and have been majority-owned by the founding family since 1668.",
          "website": "https://www.merckgroup.com/en",
          "logo": "/static/media/sponsors/merck.svg",
          "scale": null
        }
      ]
    },
    {
      "name": "Diamond",
      "id": "diamond",
      "sponsors": [
        {
          "name": "Pydantic Logfire",
          "id": "pydantic_logfire",
          "headline": "Pydantic Logfire",
          "description": "From the team behind Pydantic, Logfire is a new type of observability platform built on the same belief as our open source library — that the most powerful tools can be easy to use.",
          "website": "https://logfire.dev",
          "logo": "/static/media/sponsors/pydantic_logfire.png",
          "scale": null
        }
      ]
    },
    {
      "name": "Platinum",
      "id": "platinum",
      "sponsors": [
        {
          "name": "QuantCo",
          "id": "quantco",
          "headline": "",
          "description": "At QuantCo, we leverage expertise in data science, engineering, and economics to help organizations turn data into decisions. Founded by 4 PhDs from Harvard and Stanford, we are now more than 180 professionals with extensive quantitative, AI, engineering, and business experience.<br/><br/> Our solutions include algorithmic pricing, data-driven claims management, high-dimensional forecasting solutions, classification engines, and cancer diagnostics.<br/><br/> We are globally distributed with offices in Berlin, Boston, Cologne, Karlsruhe, London, Munich, San Francisco, and Zurich.",
          "website": "https://www.quantco.com",
          "logo": "/static/media/sponsors/quantco.svg",
          "scale": null
        },
        {
          "name": "E.ON",
          "id": "eon",
          "headline": "",
          "description": "At E.ON Digital Technology we love technology. As digital pioneers within the E.ON Group, we firmly believe in the power of transformation to create new business opportunities and drive innovation. Every day we act according to our purpose 'Making New Energy Work'. Step by step, we are digitising all parts of the energy system.",
          "website": "https://www.eon.com/en/about-us/careers/our-companies/digital-technology.html",
          "logo": "/static/media/sponsors/eon.svg",
          "scale": null
        },
        {
          "name": "ZEISS",
          "id": "zeiss",
          "headline": "",
          "description": "ZEISS is technology. ZEISS is optics and innovation. Our over 38,000 colleagues develop, manufacture and sell highly innovative products and solutions for our customers in a variety of business fields, generating revenue of over €8,5 billion. As one of the world's top technology companies, ZEISS has with a portfolio aligned with future growth areas like digitalization, healthcare and Smart Production, and a strong brand to boot, ZEISS is shaping the future far beyond the optics and optoelectronics industries.",
          "website": "https://www.zeiss.com",
          "logo": "/static/media/sponsors/zeiss.svg",
          "scale": "scale-80"
        },
        {
          "name": "Exasol",
          "id": "exasol",
          "headline": "",
          "description": "The Exasol Analytics Engine is purpose-built to handle the most demanding data workloads at an unmatched price/performance ratio.<br/><br/>\nTrusted globally, it delivers near real-time insights, advanced AI capabilities, and self-tuning functionality—enabling faster, smarter business decisions. Whether used as a standalone data warehouse, analytics accelerator, or AI/ML model enabler, Exasol ensures reliable, high-performance analytics across on-premises and hybrid environments.",
          "website": "https://www.exasol.com/",
          "logo": "/static/media/sponsors/Exasol_Logo_2025_Dark.svg",
          "scale": "scale-70"
        },
        {
          "name": "Rosenxt",
          "id": "rosenxt",
          "headline": "",
          "description": "Rosenxt is a forward-thinking technology group with decades of engineering excellence. Established in 2023 by Hermann Rosen, founder of ROSEN, we are a privately owned global partner with around 500 highly qualified employees. Leveraging our deep expertise in sensor technology, autonomous robotics, AI and advanced materials, we explore new market opportunities and build new ventures for customers operating critical infrastructure in harsh environments like subsea and offshore structures, waterline infrastructure, the upstream energy market.",
          "website": "https://www.rosen-nxt.com/en",
          "logo": "/static/media/sponsors/rosenxt.svg",
          "scale": null
        },
        {
          "name": "Gurobi Optimization",
          "id": "gurobi",
          "headline": "",
          "description": "With Gurobi’s decision intelligence technology, customers can make optimal business decisions in seconds. From workforce scheduling and portfolio optimization to supply chain design, Gurobi identifies the optimal solution, out of trillions of possibilities.<br/><br/> As the leader in decision intelligence, Gurobi delivers easy-to-integrate, full-featured software and best-in-class support, with an industry-leading 98% customer satisfaction rating. Founded in 2008, Gurobi has operations in the Americas, Europe and Asia serving customers in nearly all industries. For more information, please visit https://www.gurobi.com/",
          "website": "https://www.gurobi.com/",
          "logo": "/static/media/sponsors/gurobi.svg",
          "scale": "scale-90"
        },
        {
          "name": "JetBrains",
          "id": "jetbrains",
          "headline": "",
          "description": "JetBrains, the creators of industry-leading tools like IntelliJ IDEA, PyCharm, DataGrip, and Datalore, will be at PyCon DE & PyData 2025 to showcase their products for data professionals. PyCharm, the IDE designed with data and ML professionals in mind, supports Python, databases, Jupyter, Git, conda, PyTorch, TensorFlow, and more. Its context-aware AI Assistant streamlines development, making it easier to build pipelines, prototype ML models, and analyze data. Come meet the JetBrains PyCharm team to explore solutions to your data challenges.",
          "website": "https://www.jetbrains.com/",
          "logo": "/static/media/sponsors/JetBrains-logo-RGB.svg",
          "scale": "scale-90"
        },
        {
          "name": "MOSTLY AI",
          "id": "mostlyai",
          "headline": "",
          "description": "MOSTLY AI develops technology for generating high-fidelity, privacy-safe synthetic data at scale. Its open-source Synthetic Data SDK and enterprise platform empower organizations to securely share, access, and extract actionable insights from data.",
          "website": "https://mostly.ai/",
          "logo": "/static/media/sponsors/MOSTLY.AI_logo_full_colourGradient_RGB.svg",
          "scale": "scale-90"
        },
        {
          "name": "Blue Yonder",
          "id": "blueyonder",
          "headline": "",
          "description": "Blue Yonder is the world leader in digital supply chain transformations and omni-channel commerce fulfillment. Our end-to-end, cognitive business platform enables retailers, manufacturers and logistics providers to best fulfill customer demand from planning through delivery. With Blue Yonder, you’ll unify your data, supply chain and retail commerce operations to unlock new business opportunities and drive automation, control and orchestration to enable more profitable, sustainable business decisions.",
          "website": "https://blueyonder.com/",
          "logo": "/static/media/sponsors/blueyonder.svg",
          "scale": null
        },
        {
          "name": "Snowflake",
          "id": "snowflake",
          "headline": "",
          "description": "Snowflake makes enterprise AI easy, efficient and trusted. More than 11,000 companies around the globe, including hundreds of the world’s largest, use Snowflake’s AI Data Cloud to share data, build applications, and power their business with AI. The era of enterprise AI is here. Learn more at snowflake.com (NYSE: SNOW).",
          "website": "https://www.snowflake.com/en/",
          "logo": "/static/media/sponsors/snowflake-logo-color-rgb.svg",
          "scale": null
        },
        {
          "name": "Okta",
          "id": "okta",
          "headline": "",
          "description": "The Auth0 Platform enables companies, nonprofits and governmental agencies to transform their own customers’ or citizens’ experiences by empowering development teams. Auth0 primarily supports consumer and SaaS applications. It empowers application builders to innovate faster by removing the complexity from identity and making it simple, extensible and customizable.",
          "logo": "/static/media/sponsors/Auth0_Shield Lockup_Black_RGB.svg",
          "website": "https://a0.to/pyconde2025",
          "scale": "scale-80"
        },
        {
          "name": "Redis",
          "id": "redis",
          "headline": "",
          "description": "We’re the world’s fastest in-memory database. From our open source origins in 2011 to becoming the #1 cited brand for caching solutions, we’ve helped more than 10,000 customers build, scale, and deploy the apps our world runs on. With cloud and on-prem databases for caching, vector search, and more, we’re helping digital businesses set a new standard for speed. To find out more, visit redis.io.",
          "website": "https://redis.io/",
          "logo": "/static/media/sponsors/redis.svg",
          "scale": "scale-80"
        },
        {
          "name": "Hopsworks",
          "id": "hopsworks",
          "headline": "",
          "description": "Hopsworks is the pioneering AI Lakehouse platform designed to support MLOps, data science, data engineering, and machine learning within a unified, seamless environment. The AI Lakehouse is a modern infrastructure built around the industry’s first enterprise feature store, made to support the unique needs of AI and machine learning workloads.<br/><br/>\nIt simplifies the deployment and development of AI models and provides a structured, efficient approach to building and maintaining AI systems, enabling faster model creation and smoother production deployment.",
          "website": "https://www.hopsworks.ai/",
          "logo": "/static/media/sponsors/hopsworks.svg",
          "scale": null
        }
      ]
    },
    {
      "name": "Gold",
      "id": "gold",
      "sponsors": [
        {
          "name": "Rosen",
          "id": "rosen",
          "headline": "We are empowered by technology",
          "description": "For us, technology is the driving force of progress to ensure a more sustainable future for our customers, their assets and society.<br/><br/>\nAs a global technology company, we focus on empowering our customers to make the best decisions for their critical industrial assets. With a portfolio of highly advanced proprietary diagnostic technologies, a vast and unique data set, and industry-leading software solutions combined with integrity engineering consulting services, we offer a unique synergy that allows us to transform data into knowledge. Knowledge enables smarter decision-making and delivers a comprehensive understanding of asset safety, lifetime, and performance.",
          "website": "https://www.rosen-group.com/en/",
          "logo": "/static/media/sponsors/rosen_c.svg",
          "scale": null
        },
        {
          "name": "sovanta",
          "id": "sovanta",
          "headline": "",
          "description": "sovanta has been advising and supporting SAP customers in the cloud environment for 15 years and has developed into a specialist BTP partner: As an end-to-end expert, we answer every question relating to BTP and embark on the BTP journey together with our customers. #BTPSquad #InnovationFactory",
          "website": "https://sovanta.com/",
          "logo": "/static/media/sponsors/sovanta.svg",
          "scale": null
        },
        {
          "name": "ExperTeach",
          "id": "exerteach",
          "headline": "",
          "description": "Training and consulting for IT, telecommunications and network technology are the focus of ExperTeach’s offering. The aim is to make the customers’ IT teams fit for the challenges of digitalization!<br/><br/> ExperTeach is a partner of AWS, Broadcom, Citrix, Check Point, Cisco, Microsoft and many other IT providers. In addition to the standard training courses offered by these companies, ExperTeach offers a wide range of German-language IT courses developed in-house. Methodologically, face-to-face courses, online courses, hybrid courses as a combination of both as well as digital learning and e-learning are used.",
          "website": "https://www.experteach.de",
          "logo": "/static/media/sponsors/experteach.svg",
          "scale": "scale-80"
        },
        {
          "name": "Kraken",
          "id": "kraken",
          "headline": "",
          "description": "Kraken powers some of the most innovative global developments in energy. We’re a technology company focused on creating a smart, sustainable energy system. From optimising renewable generation, creating a more intelligent grid and enabling utilities to provide excellent customer experiences, our operating system for energy is transforming the industry around the world in a way that benefits everyone.",
          "website": "https://kraken.tech/",
          "logo": "/static/media/sponsors/Stacked_ Kraken_logo_Dark_RGB.svg",
          "scale": "scale-80"
        },
        {
          "name": "prokube",
          "id": "prokube",
          "headline": "",
          "description": "prokube is an integrated MLOps platform based on Kubernetes, Kubeflow, MLFlow, and many more best-of-breed open-source solutions, running anywhere you need it to. On-premises, in the cloud, or in a corporate data center, prokube runs where you need it to.<br/><br/> No matter if you are a data scientist, machine learning engineer, or DevOps engineer, prokube provides you with the tools you need to build, train, deploy, and monitor your machine models. prokube is designed to be easy to use and maintain and to provide you with the flexibility you need.",
          "website": "https://prokube.ai",
          "logo": "/static/media/sponsors/prokube-logo-positive.svg",
          "scale": "scale-80"
        },
        {
          "name": "Heidelberger Druckmaschinen AG",
          "id": "heidelberger-druckmaschinen",
          "headline": "",
          "description": "Heidelberger Druckmaschinen AG (HEIDELBERG) is a leading technology company that has been standing for innovative strength and quality in mechanical engineering for 175 years. As a growth-focused solutions provider, HEIDELBERG is driving further the development of packaging, digital printing and software solutions, as well as the service and consumables business. The company is also continuing to expand new business areas in the industrial business and green technologies. HEIDELBERG is represented in 170 countries and employs around 9,500 people.",
          "website": "https://www.heidelberg.com",
          "logo": "/static/media/sponsors/heidelberger-druckmaschinen.png",
          "scale": null
        },
        {
          "name": "Vonage",
          "id": "vonage",
          "headline": "",
          "description": "Vonage is a cloud communications platform that allows developers to integrate voice, video and messaging into their applications using their Network APIs and Communication APIs. So whether you want to build video calls into your app, create a Whatsapp bot, or build applications on top of programmable phone numbers, Vonage has got you covered.",
          "website": "https://developer.vonage.com/",
          "logo": "/static/media/sponsors/VonagePOE_Primary.svg",
          "scale": "scale-80"
        },
        {
          "name": "Aleph Alpha",
          "id": "aleph-alpha",
          "headline": "",
          "description": "Aleph Alpha was founded in 2019 with the mission to research and build the foundational technology for an era of strong AI. The team of international scientists, engineers, and innovators researches, develops, and deploys transformative AI like large language and multimodal models and runs the fastest European commercial AI cluster. Its generative AI solutions are the prime choice for enterprises and governmental institutions seeking to retain independence, secure their data, and build trustworthy solutions.",
          "website": "https://aleph-alpha.com/",
          "logo": "/static/media/sponsors/AlephAlpha_logo-ver_BasaltBlack_rgb.svg",
          "scale": "scale-80"
        },
        {
          "name": "Data Santander",
          "id": "data-santander",
          "headline": "",
          "description": "Data Santander provides highly-customized data to enhance the value of software packages. We help to \"fill in\" software packages to provide better development, debugging, demo, and deployment of those software packages.<br/><br/>\nMany times software companies sell the tools (\"with this you can build anything you want!\"), when in reality clients want the finished product that delivers an impact (\"can you give me a pink wooden pony for my daughter's birthday?\").",
          "website": "https://datasdr.com/",
          "logo": "/static/media/sponsors/data-santander.svg",
          "scale": null
        },
        {
          "name": "DeepL",
          "id": "deepl",
          "headline": "",
          "description": "DeepL is on a mission to break down language barriers for businesses everywhere. Over 200,000 businesses and governments and millions of individuals across 228 global markets trust DeepL's Language AI platform for human-like translation in both written and spoken formats, as well as natural, improved writing. Designed with enterprise security in mind, companies around the world leverage DeepL's AI solutions that are specifically tuned for language to transform business communications, expand markets and improve productivity. Founded in 2017 by CEO Jaroslaw (Jarek) Kutylowski, DeepL today has over 1,000 passionate employees and is supported by world-renowned investors including Benchmark, IVP and Index Venture.",
          "website": "https://www.deepl.com",
          "logo": "/static/media/sponsors/DeepL-RGB .svg",
          "scale": null
        }
      ]
    },
    {
      "name": "Silver",
      "id": "silver",
      "sponsors": [
        {
          "name": "inovex GmbH",
          "id": "inovex",
          "headline": "inovex GmbH",
          "description": "inovex is an IT project center driven by innovation and quality, focusing its services on ‘Digital Transformation’. About 500 IT experts provide comprehensive support to companies in making their core business digitised and agile and in implementing new digital use cases. inovex has locations in Karlsruhe, Cologne, Munich, Hamburg, Berlin, Stuttgart, Pforzheim and Erlangen and is involved in projects throughout Germany.",
          "website": "https://www.inovex.de/en/",
          "logo": "/static/media/sponsors/inovex.svg",
          "scale": "scale-80"
        },
        {
          "name": "Lidl Stiftung & Co. KG",
          "id": "lidl",
          "headline": "Lidl Stiftung & Co. KG",
          "description": "Lidl is a part of the Schwarz Group with headquarters in Neckarsulm, Germany, and is one of the leading food retailers in Germany and Europe. Lidl currently operates around 12,350 stores and more than 220 goods distribution and logistics centers in 31 countries and employs around 375,000 people.<br/><br/>\nAt Lidl, we value an optimal price-performance ratio for our customers. Simplicity and process orientation determine the daily activities in the stores, the regional distribution centers and the national headquarters.",
          "website": "https://info.lidl/",
          "logo": "/static/media/sponsors/lidl.svg",
          "scale": "scale-70"
        },
        {
          "name": "Bausparkasse Schwäbisch Hall AG",
          "id": "schwaebisch_hall",
          "headline": "Bausparkasse Schwäbisch Hall AG",
          "description": "Schwäbisch Hall is the largest German Bausparkasse (Building society) and one of the leading providers of housing financing. A team of around 6,800 people works closely with the German Cooperative Banks to create and preserve homes for the customers with more than 7 million contracts. The company sees Data Science and AI as key drivers of producitvity, creativitiy and job satisfaction, while maintaining their core focus on human-centered business.",
          "website": "https://www.schwaebisch-hall.de/",
          "logo": "/static/media/sponsors/bausparkasse-schwaebisch-hall.svg",
          "scale": null
        },
        {
          "name": "REWE Group",
          "id": "rewe",
          "headline": "REWE Group",
          "description": "REWE Group, headquartered in Cologne, is one of the leading retail and tourism groups in Europe. As a reliable employer with over 390.000 employees, we form a strong community as a cooperatively organized company that has been shaping change and the future of retail and tourism with a great deal of courage to since 1927. In our Analytics Team we deal with all analytical issues along the REWE Group value chain. Our infinite treasure trove of data results from 8 million receipts per day from 6,500 stores with 250 thousand different articles.",
          "website": "https://jobs.rewe-group.com/direkteinstiege/analytics",
          "logo": "/static/media/sponsors/REWEGr_RGB_mitSchutzraum.svg",
          "scale": null
        },
        {
          "name": "Quansight",
          "id": "quansight",
          "headline": "Quansight",
          "description": "Quansight is a data, science, and engineering firm that specializes in solving complex, data-related problems by leveraging the open source software at the foundation of AI and machine learning. Quansight is led by Travis Oliphant, who founded Anaconda, NumFOCUS, PyData, and authored or led the creation of foundational Python ecosystem packages NumPy, SciPy, Numba, and Conda.",
          "website": "https://quansight.com",
          "logo": "/static/media/sponsors/quansight.svg",
          "scale": null
        },
        {
          "name": "items GmbH & Co. KG",
          "id": "items",
          "headline": "items GmbH & Co. KG",
          "description": "In more than 25 years, we have become one of the leading IT service providers in the energy industry and are a complete IT service provider for the utility and mobility industries.<br/><br/>\nAs an industry specialist and innovation driver, we offer IT infrastructure, consulting, and process services with a focus on collaboration platforms, IoT integration of smart city technologies, AI products and robotics.<br/><br/>\nWe set standards in the concrete implementation of digitalisation in smart city and smart region projects. ",
          "website": "https://www.itemsnet.de",
          "logo": "/static/media/sponsors/items.svg",
          "scale": "scale-80"
        },
        {
          "name": "energy & meteo systems",
          "id": "energy_meteo",
          "headline": "energy & meteo systems",
          "description": "The partner companies energy & meteo systems, emsys VPP and emsys grid services offer pioneering services and IT products for the market and grid integration of renewable energies worldwide. Their joint portfolio ranges from precise power forecasts and comprehensive consulting services to the development of virtual power plants as control centres for decentralised energy plants and customised platform concepts for grid planning.",
          "website": "https://www.emsys-renewables.com/de/",
          "logo": "/static/media/sponsors/em.svg",
          "scale": null
        },
        {
          "name": "Cologne Intelligence",
          "id": "cologne_intelligence",
          "headline": "Cologne Intelligence",
          "description": "Cologne Intelligence (CI) is a #Digitalisierungsverwirklicher based in Cologne and Frankfurt.\nBackend, frontend, and data & analytics: They understand their customers' ideas and translate individual requirements into digital products.\nTheir 180 employees convince with analytical and technological expertise, provide honest advice and think thoroughly digital.",
          "website": "https://www.cologne-intelligence.de/",
          "logo": "/static/media/sponsors/cologne_intelligence.svg",
          "scale": null
        },
        {
          "name": "&effect data solutions GmbH",
          "id": "effect_data_solutions",
          "headline": "&effect data solutions GmbH",
          "description": "&effect data solutions GmbH specialises in the development of innovative data solutions for the social and public sector. Our mission is to make data science an integral part of decision-making in the public and social sectors: Data in the service of the public good.",
          "website": "https://www.and-effect.com/",
          "logo": "/static/media/sponsors/effect_data_solutions.svg",
          "scale": null
        },
        {
          "name": "Innoflair",
          "id": "innoflair",
          "headline": "Innoflair",
          "description": "Innoflair is a flexible and forward-thinking development company specializing in the space industry. We focus on Earth Observation, ground segment engineering, and innovative solutions for complex challenges. We excel in integrating open-source software and cutting-edge web technologies, empowering space agencies and satellite operators to achieve their missions efficiently. With a proven track record, we drive forward-thinking solutions that enhance operational capabilities and maximize data value.",
          "website": "https://innoflair.com/",
          "logo": "/static/media/sponsors/innoflair.svg",
          "scale": null
        },
        {
          "name": "quattro research GmbH",
          "id": "quattro_research",
          "headline": "quattro research GmbH",
          "description": "quattro research GmbH is an interdisciplinary team of scientists and IT specialists headquartered in Martinsried, southwest of Munich. The company develops innovative IT solutions and products for customers in the life science, pharmaceutical, and chemical industries. Services include the development of individual software solutions, data migration and standardization, design and implementation of database models, and optimization of scientific workflows.",
          "website": "https://www.quattro-research.com",
          "logo": "/static/media/sponsors/quattro_research.svg",
          "scale": null
        },
        {
          "name": "Beauhurst",
          "id": "beauhurst",
          "headline": "",
          "description": "Beauhurst provides data on every private company in the UK and Germany to help our clients discover, track and understand businesses. We source, extract and package data from thousands of locations to create the ultimate private company database with our four data platforms: BeauhurstAdvise, BeauhurstInvest, BeauhurstImpact and BeauhurstSales.",
          "website": "https://www.beauhurst.com",
          "logo": "/static/media/sponsors/beauhurst.svg",
          "scale": "scale-70"
        },
        {
          "name": "ABO Energy",
          "id": "aboenergy",
          "headline": "",
          "description": "Founded in 1996, ABO Energy is among Europe’s leading developers of renewable energy projects. We develop, engineer, build, and maintain wind and solar farms as well as hybrid energy, battery storage, and hydrogen projects in 16 countries on 4 continents. More than 1,200 colleagues contribute towards climate protection and a sustainable energy supply. To date, ABO Energy has realised projects with a total capacity of about 6 gigawatts and constructed around half of these.",
          "website": "https://www.aboenergy.com",
          "logo": "/static/media/sponsors/abo_energy.svg",
          "scale": null
        },
        {
          "name": "Sunnic Lighthouse GmbH",
          "id": "sunnic-ligthhouse",
          "headline": "",
          "description": "Sunnic Lighthouse GmbH, based in Hamburg, is a subsidiary of ENERPARC AG. As a leading specialist in the industry, Sunnic offers individual services in the field of renewable energies: from direct marketing and power supply to hedging transactions via power purchase agreements. The main focus is on green power from German photovoltaic plants - in addition to all other sustainable power sources.<br/><br/>\nAt Sunnic, Python is used to automate a large part of the processes, including trading processes. Different departments continuously analyze meteorological, trading and sales-related data from various sources and thus help to improve processes and strategies. The company relies on open source technologies, with which a standardized infrastructure has been established. The infrastructure is directly connected to various power exchanges and enables automated trading.",
          "website": "https://www.sunnic.de/",
          "logo": "/static/media/sponsors/Logo-SunnicLighthouse-2farbig.svg",
          "scale": null
        }
      ]
    },
    {
      "name": "Institutional Partners",
      "id": "institutional-sponsors",
      "sponsors": [
        {
          "name": "Python Softwareverband e.V.",
          "id": "pysv",
          "headline": "Python Softwareverband e.V.",
          "description": "The Python Software Verband (PySV) is an association dedicated to supporting and promoting the Python programming language and its community across German-speaking countries. As a central hub for Python enthusiasts, professionals, and organizations, PySV fosters collaboration, knowledge exchange, and the responsible use of open technologies.<br/><br/>\nThe association advocates for the visibility and sustainable growth of the Python ecosystem by organizing events, enabling networking opportunities, and representing community interests in public and professional forums. PySV also supports educational initiatives, local meetups, and open-source contributions—helping to create a vibrant, inclusive, and future-oriented Python community.<br/><br/>\nThrough its close collaboration with international partners and local communities alike, the Python Software Verband plays a vital role in strengthening Python’s presence and impact in Germany, Austria, and Switzerland.",
          "website": "https://pysv.org",
          "logo": "/static/media/sponsors/pysv.svg",
          "scale": null
        },
        {
          "name": "NumFOCUS",
          "id": "numfocus",
          "headline": "NumFOCUS",
          "description": "NumFOCUS is a nonprofit organization that supports open source software in science, technology, engineering, and mathematics (STEM). Its mission is to promote sustainable, high-quality, open source projects and foster an inclusive and collaborative community around them.<br/><br/>\nBy providing financial, legal, and operational support to core open source projects like NumPy, pandas, Jupyter, and many others, NumFOCUS helps ensure that vital tools remain accessible and reliable for the global data and scientific communities. Beyond software, NumFOCUS cultivates diversity and education through programs like PyData, community events, fellowships, and outreach initiatives—building a more inclusive future for open source.",
          "website": "https://numfocus.org",
          "logo": "/static/media/sponsors/numfocus.svg",
          "scale": null
        },
        {
          "name": "Pioneers Hub",
          "id": "pioneershub",
          "headline": "Pioneers Hub: Driving Innovation, Empowering Tech Communities",
          "description": "Pioneers Hub is a non-profit organization committed to advancing innovation and strengthening the fabric of tech communities. With a strong focus on artificial intelligence, software, and data, Pioneers Hub connects professionals, enthusiasts, and domain experts to foster meaningful exchange and interdisciplinary collaboration.<br/><br/>\nThrough its community-driven approach, the organization provides platforms for dialogue, learning, and co-creation—empowering individuals and organizations to better understand, adopt, and shape emerging technologies. Pioneers Hub actively supports open-source initiatives, promotes diversity and inclusion, and encourages a culture of curiosity, excellence, and responsible innovation.<br/><br/>\nBy nurturing ecosystems where experimentation is welcome and expertise is shared, Pioneers Hub helps communities keep pace with rapid technological change and contributes to building a more sustainable, open, and innovative future.<br/><br/>\nPioneers Hub supports PyCon DE & PyData, PyData Berlin, PyData Südwest, PyData RheinMain, PyLadies Südwest and other high tech communities.",
          "website": "https://pioneershub.org",
          "logo": "/static/media/sponsors/pioneershub.svg",
          "scale": null
        }
      ]
    },
    {
      "name": "Diversity Sponsors",
      "id": "diversity-sponsors",
      "sponsors": [
        {
          "name": "Python Software Foundation",
          "id": "psf",
          "headline": "Python Software Foundation",
          "description": "The mission of the Python Software Foundation is to promote, protect, and advance the Python programming language, and to support and facilitate the growth of a diverse and international community of Python programmers. The majority of the PSF's work is focused on empowering and supporting people within the Python community. The PSF has active grant programs that support sprints, conferences, meet ups, user groups, and Python development efforts all over the world.",
          "website": "https://www.python.org/psf/",
          "logo": "/static/media/sponsors/psf.png",
          "scale": "scale-80"
        },
        {
          "name": "EuroPython Society (EPS)",
          "id": "eps",
          "headline": "EuroPython Society (EPS)",
          "description": "The EuroPython Society (EPS) is a Swedish non-profit organization which organizes EuroPython conferences, supports the Python community in Europe.",
          "website": "https://www.europython-society.org",
          "logo": "/static/media/sponsors/eps.png",
          "scale": "scale-80"
        }
      ]
    },
    {
      "name": "Community Partners",
      "id": "community-partners",
      "sponsors": [
        {
          "name": "appliedAI Institute for Europe gGmbH",
          "id": "applied-ai-institute",
          "headline": "appliedAI Institute for Europe gGmbH",
          "description": "The appliedAI Institute for Europe strengthens the European AI ecosystem by providing AI knowledge and fostering research. Founded as a non-profit subsidiary of the appliedAI Initiative, the Institute aims to be part of and build a trustworthy AI community. Supported by the KI-Stiftung Heilbronn, it offers formats for networking and collaboration.",
          "website": "https://www.appliedai-institute.de/en/",
          "logo": "/static/media/sponsors/appliedAI_horizontal_rgb_RZ.svg",
          "scale": null
        },
        {
          "name": "Hessian AI",
          "id": "hessian_ai",
          "headline": "hessian.AI – the Hessian Centre for Artificial Intelligence",
          "description": "The Hessian Center for Artificial Intelligence is an association of 13 Hessian universities and pursues the goal of conducting cutting-edge research with concrete practical relevance. As a research and innovation center, hessian.AI promotes the transfer of results to business and society through the training of AI talent, the promotion of start-ups and cooperation with companies.",
          "website": "https://hessian.ai",
          "logo": "/static/media/sponsors/hessian.AI-vertical.svg",
          "scale": null
        },
        {
          "name": "ULB - University and State Library Darmstadt",
          "id": "ulb",
          "headline": "ULB - University and State Library Darmstadt",
          "description": "The University and State Library Darmstadt is the central university library of TU Darmstadt and the universal academic library for the population of Southern Hesse.<br/><br/> We provide tons of textual and other data for research and develop and maintain several software projects for open science applications, especially in the field of research data management.",
          "website": "https://www.ulb.tu-darmstadt.de/die_bibliothek/index.de.jsp",
          "logo": "/static/media/sponsors/ulb_logo_schriftzug_tuerkis_rgb.svg",
          "scale": null
        },
        {
          "name": "PyLadies Südwest",
          "id": "pyladies_suedwest",
          "headline": "PyLadies Südwest",
          "description": "PyLadies is an international mentorship group with a focus on helping more women become active participants and leaders in the Python open-source community. Our mission is to promote, educate and advance a diverse Python community through outreach, education, conferences, events and social gatherings. PyLadies also aims to provide a friendly support network for women and a bridge to the larger Python world. Anyone with an interest in Python is encouraged to participate! PyLadies Südwest meet regularly. There is usually a talk and a hands-on session over a Python topic and sometimes we do a book club meeting. Anyone is welcome to propose topics that wishes to learn and give a talk.",
          "website": "https://www.meetup.com/de-DE/pyladies-suedwest/",
          "logo": "/static/media/sponsors/pyladies-suedwest.svg",
          "scale": "scale-70"
        },
        {
          "name": "PyLadies Hamburg",
          "id": "pyladies_hamburg",
          "headline": "PyLadies Hamburg",
          "description": "We're the Hamburg chapter of PyLadies, an international mentorship group for marginalized genders, such as but not limited to non-binary people, trans people, and women in tech. <br/><br/> We host monthly events, talks, workshops and study groups where you can meet other pythonistas and learn more about programming, data science, web development, and more. All skill levels welcome!",
          "website": "https://hamburg.pyladies.com/",
          "logo": "/static/media/sponsors/pyladies-hamburg.svg",
          "scale": "scale-90"
        },
        {
          "name": "PyLadies Berlin",
          "id": "pyladies_berlin",
          "headline": "PyLadies Berlin",
          "description": "PyLadies is an international mentorship group for marginalized genders, such as but not limited to non-binary people, trans people, and women in tech, with a focus on helping our community become active participants and leaders in the Python open-source community. All skill levels are welcome!",
          "website": "https://berlin.pyladies.com/",
          "logo": "/static/media/sponsors/pyladies-berlin.png",
          "scale": "scale-70"
        },
        {
          "name": "PyLadies Munich",
          "id": "pyladies_munich",
          "headline": "PyLadies Munich",
          "description": "We are the Munich chapter of an international mentorship group, PyLadies, with a focus on helping more women become active participants and leaders in the Python open-source community. Our mission is to promote, educate and advance a diverse Python community through outreach, education, conferences, events, and social gatherings. PyLadies also aims to provide a friendly support network for women and a bridge to the larger Python world.",
          "website": "https://www.meetup.com/de-DE/pyladiesmunich/",
          "logo": "/static/media/sponsors/pyladies-munich-w.png",
          "scale": null
        },
        {
          "name": "PyData Südwest",
          "id": "pydata_suedwest",
          "headline": "PyData Südwest",
          "description": "PyData Südwest is a dynamic community connecting data science and AI enthusiasts across Heidelberg, Mannheim, Karlsruhe, and Heilbronn. This region, renowned for its thriving tech ecosystem and innovation hubs, plays a pivotal role in advancing AI research and applications in Germany. PyData Südwest fosters collaboration and knowledge exchange through engaging meetups and events, creating a welcoming space for professionals, researchers, and students to share ideas, explore cutting-edge technologies, and strengthen the local AI and open-source community.",
          "website": "https://www.meetup.com/pydata-suedwest/",
          "logo": "/static/media/sponsors/pydata-suedwest.svg",
          "scale": null
        },
        {
          "name": "PyData Rhein-Main",
          "id": "pydata_rhein_main",
          "headline": "PyData Rhein-Main",
          "description": "PyData Rhein-Main unites the vibrant data science and AI community across Frankfurt, Darmstadt, and Wiesbaden, regions known for their strong tech industry, academic excellence, and innovation hubs. As part of the global PyData network, it offers a platform for professionals, researchers, and enthusiasts to connect, share knowledge, and collaborate on cutting-edge topics in AI, machine learning, and open-source tools. Through regular meetups and events, PyData Rhein-Main fosters a supportive environment for learning, networking, and driving innovation in the heart of Germany.",
          "website": "https://www.meetup.com/pydata-frankfurt/",
          "logo": "/static/media/sponsors/pydata-rhein-main.svg",
          "scale": null
        },
        {
          "name": "PyData Berlin",
          "id": "pydata_berlin",
          "headline": "PyData Berlin",
          "description": "PyData Berlin is a thriving hub for data science, machine learning, and AI enthusiasts in one of Europe’s leading tech capitals. As part of the global PyData network, it brings together professionals, researchers, and open-source contributors to share knowledge, foster collaboration, and explore innovative solutions. With Berlin’s dynamic startup scene, academic institutions, and vibrant international community, PyData Berlin serves as a cornerstone for advancing AI and data-driven technologies while promoting inclusivity and open-source excellence.",
          "website": "https://berlin.pydata.org/",
          "logo": "/static/media/sponsors/pydata-berlin.svg",
          "scale": null
        },
        {
          "name": "DjangoGirls",
          "id": "djangogirls",
          "headline": "DjangoGirls",
          "description": "DjangoGirls is a global initiative dedicated to empowering women and non-binary individuals to break into tech by learning programming through Django, a popular Python web framework. By hosting free, beginner-friendly workshops, DjangoGirls provides a supportive and inclusive environment for participants to build their first web applications, gain confidence in coding, and connect with a welcoming community of mentors and peers. With events held in cities around the world, DjangoGirls is making tech more accessible and fostering diversity in the industry.",
          "website": "https://djangogirls.org/de/darmstadt/",
          "logo": "/static/media/sponsors/djangogirls-logo.svg",
          "scale": null
        },
        {
          "name": "AISR",
          "id": "hessian_ai",
          "headline": "AI Startup Rising (AISR) drives hessian.AI’s initiatives to support the emergence and growth of high-tech and deep-tech startups throughout Hesse",
          "description": "AI Startup Rising (AISR) drives hessian.AI’s initiatives to support the emergence and growth of high-tech and deep-tech startups throughout Hesse. AISR seeks to build and strengthen an agile AI innovation ecosystem that is grounded in cutting-edge research and brings together talents, experts, startups, investors, and companies.",
          "website": "https://hessian.ai/category/ai-startup-rising/",
          "logo": "/static/media/sponsors/AISR_Logo_RGB.svg",
          "scale": null
        },
        {
          "name": "Probably Private",
          "id": "probably_private",
          "headline": "Probably Private",
          "description": "Probably Private is a newsletter and YouTube channel for privacy and data science enthusiasts. Whether you are here to learn about AI, machine learning and data science via the lens of privacy, or the other way around, this place is an open conversation on technical and social aspects of privacy and their intersections with surveillance, law, technology, mathematics and probability.",
          "website": "https://probablyprivate.com/",
          "logo": "/static/media/sponsors/probably_private_circle.png",
          "scale": "scale-80"
        },
        {
          "name": "spaCy",
          "id": "spacy",
          "headline": "spaCy",
          "description": "Explosion is a software company specializing in developer tools for AI and Natural Language Processing. We’re the makers of spaCy, one of the leading open-source libraries for advanced NLP and Prodigy, an annotation tool for radically efficient machine teaching.",
          "website": "https://spacy.io/",
          "logo": "/static/media/sponsors/spacy_logo_blue.svg",
          "scale": null
        },
        {
          "name": "Women in AI",
          "id": "women-in-ai",
          "headline": "Women in AI",
          "description": "Women in AI is a global movement dedicated to empowering women in the field of artificial intelligence by fostering education, mentorship, and career opportunities while advocating for diversity, inclusion, and ethical AI development to create a more equitable and innovative future.",
          "website": "https://www.womeninai.co/",
          "logo": "/static/media/sponsors/WAI_Logo_Black.svg",
          "scale": null
        }
      ]
    }
  ]
}